zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/acifc.h
/**
 * \file
 *
 * \brief Component description for ACIFC
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_ACIFC_COMPONENT_
#define _SAM4L_ACIFC_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ACIFC */
/* ========================================================================== */
/** \addtogroup SAM4L_ACIFC Analog Comparator Interface */
/*@{*/

#define ACIFC_I7564
#define REV_ACIFC                   0x101

/* -------- ACIFC_CTRL : (ACIFC Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  ACIFC Enable                       */
    uint32_t EVENTEN:1;        /*!< bit:      1  Peripheral Event Trigger Enable    */
    uint32_t :2;               /*!< bit:  2.. 3  Reserved                           */
    uint32_t USTART:1;         /*!< bit:      4  User Start Single Comparison       */
    uint32_t ESTART:1;         /*!< bit:      5  Peripheral Event Start Single Comparison */
    uint32_t :1;               /*!< bit:      6  Reserved                           */
    uint32_t ACTEST:1;         /*!< bit:      7  Analog Comparator Test Mode        */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_CTRL_OFFSET           0x00         /**< \brief (ACIFC_CTRL offset) Control Register */
#define ACIFC_CTRL_RESETVALUE       _U_(0x00000000); /**< \brief (ACIFC_CTRL reset_value) Control Register */

#define ACIFC_CTRL_EN_Pos           0            /**< \brief (ACIFC_CTRL) ACIFC Enable */
#define ACIFC_CTRL_EN               (_U_(0x1) << ACIFC_CTRL_EN_Pos)
#define ACIFC_CTRL_EVENTEN_Pos      1            /**< \brief (ACIFC_CTRL) Peripheral Event Trigger Enable */
#define ACIFC_CTRL_EVENTEN          (_U_(0x1) << ACIFC_CTRL_EVENTEN_Pos)
#define ACIFC_CTRL_USTART_Pos       4            /**< \brief (ACIFC_CTRL) User Start Single Comparison */
#define ACIFC_CTRL_USTART           (_U_(0x1) << ACIFC_CTRL_USTART_Pos)
#define ACIFC_CTRL_ESTART_Pos       5            /**< \brief (ACIFC_CTRL) Peripheral Event Start Single Comparison */
#define ACIFC_CTRL_ESTART           (_U_(0x1) << ACIFC_CTRL_ESTART_Pos)
#define ACIFC_CTRL_ACTEST_Pos       7            /**< \brief (ACIFC_CTRL) Analog Comparator Test Mode */
#define ACIFC_CTRL_ACTEST           (_U_(0x1) << ACIFC_CTRL_ACTEST_Pos)
#define ACIFC_CTRL_MASK             _U_(0x000000B3) /**< \brief (ACIFC_CTRL) MASK Register */

/* -------- ACIFC_SR : (ACIFC Offset: 0x04) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACCS0:1;          /*!< bit:      0  AC0 Current Comparison Status      */
    uint32_t ACRDY0:1;         /*!< bit:      1  AC0 Ready                          */
    uint32_t ACCS1:1;          /*!< bit:      2  AC1 Current Comparison Status      */
    uint32_t ACRDY1:1;         /*!< bit:      3  AC1 Ready                          */
    uint32_t ACCS2:1;          /*!< bit:      4  AC2 Current Comparison Status      */
    uint32_t ACRDY2:1;         /*!< bit:      5  AC2 Ready                          */
    uint32_t ACCS3:1;          /*!< bit:      6  AC3 Current Comparison Status      */
    uint32_t ACRDY3:1;         /*!< bit:      7  AC3 Ready                          */
    uint32_t ACCS4:1;          /*!< bit:      8  AC4 Current Comparison Status      */
    uint32_t ACRDY4:1;         /*!< bit:      9  AC4 Ready                          */
    uint32_t ACCS5:1;          /*!< bit:     10  AC5 Current Comparison Status      */
    uint32_t ACRDY5:1;         /*!< bit:     11  AC5 Ready                          */
    uint32_t ACCS6:1;          /*!< bit:     12  AC6 Current Comparison Status      */
    uint32_t ACRDY6:1;         /*!< bit:     13  AC6 Ready                          */
    uint32_t ACCS7:1;          /*!< bit:     14  AC7 Current Comparison Status      */
    uint32_t ACRDY7:1;         /*!< bit:     15  AC7 Ready                          */
    uint32_t :8;               /*!< bit: 16..23  Reserved                           */
    uint32_t WFCS0:1;          /*!< bit:     24  Window0 Mode Current Status        */
    uint32_t WFCS1:1;          /*!< bit:     25  Window1 Mode Current Status        */
    uint32_t WFCS2:1;          /*!< bit:     26  Window2 Mode Current Status        */
    uint32_t WFCS3:1;          /*!< bit:     27  Window3 Mode Current Status        */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_SR_OFFSET             0x04         /**< \brief (ACIFC_SR offset) Status Register */
#define ACIFC_SR_RESETVALUE         _U_(0x00000000); /**< \brief (ACIFC_SR reset_value) Status Register */

