zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/acifc.h
#define ACIFC_IMR_ACINT0_Pos        0            /**< \brief (ACIFC_IMR) AC0 Interrupt Mask */
#define ACIFC_IMR_ACINT0            (_U_(0x1) << ACIFC_IMR_ACINT0_Pos)
#define ACIFC_IMR_SUTINT0_Pos       1            /**< \brief (ACIFC_IMR) AC0 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT0           (_U_(0x1) << ACIFC_IMR_SUTINT0_Pos)
#define ACIFC_IMR_ACINT1_Pos        2            /**< \brief (ACIFC_IMR) AC1 Interrupt Mask */
#define ACIFC_IMR_ACINT1            (_U_(0x1) << ACIFC_IMR_ACINT1_Pos)
#define ACIFC_IMR_SUTINT1_Pos       3            /**< \brief (ACIFC_IMR) AC1 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT1           (_U_(0x1) << ACIFC_IMR_SUTINT1_Pos)
#define ACIFC_IMR_ACINT2_Pos        4            /**< \brief (ACIFC_IMR) AC2 Interrupt Mask */
#define ACIFC_IMR_ACINT2            (_U_(0x1) << ACIFC_IMR_ACINT2_Pos)
#define ACIFC_IMR_SUTINT2_Pos       5            /**< \brief (ACIFC_IMR) AC2 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT2           (_U_(0x1) << ACIFC_IMR_SUTINT2_Pos)
#define ACIFC_IMR_ACINT3_Pos        6            /**< \brief (ACIFC_IMR) AC3 Interrupt Mask */
#define ACIFC_IMR_ACINT3            (_U_(0x1) << ACIFC_IMR_ACINT3_Pos)
#define ACIFC_IMR_SUTINT3_Pos       7            /**< \brief (ACIFC_IMR) AC3 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT3           (_U_(0x1) << ACIFC_IMR_SUTINT3_Pos)
#define ACIFC_IMR_ACINT4_Pos        8            /**< \brief (ACIFC_IMR) AC4 Interrupt Mask */
#define ACIFC_IMR_ACINT4            (_U_(0x1) << ACIFC_IMR_ACINT4_Pos)
#define ACIFC_IMR_SUTINT4_Pos       9            /**< \brief (ACIFC_IMR) AC4 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT4           (_U_(0x1) << ACIFC_IMR_SUTINT4_Pos)
#define ACIFC_IMR_ACINT5_Pos        10           /**< \brief (ACIFC_IMR) AC5 Interrupt Mask */
#define ACIFC_IMR_ACINT5            (_U_(0x1) << ACIFC_IMR_ACINT5_Pos)
#define ACIFC_IMR_SUTINT5_Pos       11           /**< \brief (ACIFC_IMR) AC5 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT5           (_U_(0x1) << ACIFC_IMR_SUTINT5_Pos)
#define ACIFC_IMR_ACINT6_Pos        12           /**< \brief (ACIFC_IMR) AC6 Interrupt Mask */
#define ACIFC_IMR_ACINT6            (_U_(0x1) << ACIFC_IMR_ACINT6_Pos)
#define ACIFC_IMR_SUTINT6_Pos       13           /**< \brief (ACIFC_IMR) AC6 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT6           (_U_(0x1) << ACIFC_IMR_SUTINT6_Pos)
#define ACIFC_IMR_ACINT7_Pos        14           /**< \brief (ACIFC_IMR) AC7 Interrupt Mask */
#define ACIFC_IMR_ACINT7            (_U_(0x1) << ACIFC_IMR_ACINT7_Pos)
#define ACIFC_IMR_SUTINT7_Pos       15           /**< \brief (ACIFC_IMR) AC7 Startup Time Interrupt Mask */
#define ACIFC_IMR_SUTINT7           (_U_(0x1) << ACIFC_IMR_SUTINT7_Pos)
#define ACIFC_IMR_WFINT0_Pos        24           /**< \brief (ACIFC_IMR) Window0 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT0            (_U_(0x1) << ACIFC_IMR_WFINT0_Pos)
#define ACIFC_IMR_WFINT1_Pos        25           /**< \brief (ACIFC_IMR) Window1 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT1            (_U_(0x1) << ACIFC_IMR_WFINT1_Pos)
#define ACIFC_IMR_WFINT2_Pos        26           /**< \brief (ACIFC_IMR) Window2 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT2            (_U_(0x1) << ACIFC_IMR_WFINT2_Pos)
#define ACIFC_IMR_WFINT3_Pos        27           /**< \brief (ACIFC_IMR) Window3 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT3            (_U_(0x1) << ACIFC_IMR_WFINT3_Pos)
#define ACIFC_IMR_MASK              _U_(0x0F00FFFF) /**< \brief (ACIFC_IMR) MASK Register */

/* -------- ACIFC_ISR : (ACIFC Offset: 0x1C) (R/  32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACINT0:1;         /*!< bit:      0  AC0 Interrupt Status               */
    uint32_t SUTINT0:1;        /*!< bit:      1  AC0 Startup Time Interrupt Status  */
    uint32_t ACINT1:1;         /*!< bit:      2  AC1 Interrupt Status               */
    uint32_t SUTINT1:1;        /*!< bit:      3  AC1 Startup Time Interrupt Status  */
    uint32_t ACINT2:1;         /*!< bit:      4  AC2 Interrupt Status               */
    uint32_t SUTINT2:1;        /*!< bit:      5  AC2 Startup Time Interrupt Status  */
    uint32_t ACINT3:1;         /*!< bit:      6  AC3 Interrupt Status               */
    uint32_t SUTINT3:1;        /*!< bit:      7  AC3 Startup Time Interrupt Status  */
    uint32_t ACINT4:1;         /*!< bit:      8  AC4 Interrupt Status               */
    uint32_t SUTINT4:1;        /*!< bit:      9  AC4 Startup Time Interrupt Status  */
    uint32_t ACINT5:1;         /*!< bit:     10  AC5 Interrupt Status               */
    uint32_t SUTINT5:1;        /*!< bit:     11  AC5 Startup Time Interrupt Status  */
    uint32_t ACINT6:1;         /*!< bit:     12  AC6 Interrupt Status               */
    uint32_t SUTINT6:1;        /*!< bit:     13  AC6 Startup Time Interrupt Status  */
    uint32_t ACINT7:1;         /*!< bit:     14  AC7 Interrupt Status               */
    uint32_t SUTINT7:1;        /*!< bit:     15  AC7 Startup Time Interrupt Status  */
    uint32_t :8;               /*!< bit: 16..23  Reserved                           */
    uint32_t WFINT0:1;         /*!< bit:     24  Window0 Mode Interrupt Status      */
    uint32_t WFINT1:1;         /*!< bit:     25  Window1 Mode Interrupt Status      */
    uint32_t WFINT2:1;         /*!< bit:     26  Window2 Mode Interrupt Status      */
    uint32_t WFINT3:1;         /*!< bit:     27  Window3 Mode Interrupt Status      */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_ISR_OFFSET            0x1C         /**< \brief (ACIFC_ISR offset) Interrupt Status Register */
#define ACIFC_ISR_RESETVALUE        _U_(0x00000000); /**< \brief (ACIFC_ISR reset_value) Interrupt Status Register */

#define ACIFC_ISR_ACINT0_Pos        0            /**< \brief (ACIFC_ISR) AC0 Interrupt Status */
#define ACIFC_ISR_ACINT0            (_U_(0x1) << ACIFC_ISR_ACINT0_Pos)
#define ACIFC_ISR_SUTINT0_Pos       1            /**< \brief (ACIFC_ISR) AC0 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT0           (_U_(0x1) << ACIFC_ISR_SUTINT0_Pos)
#define ACIFC_ISR_ACINT1_Pos        2            /**< \brief (ACIFC_ISR) AC1 Interrupt Status */
#define ACIFC_ISR_ACINT1            (_U_(0x1) << ACIFC_ISR_ACINT1_Pos)
#define ACIFC_ISR_SUTINT1_Pos       3            /**< \brief (ACIFC_ISR) AC1 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT1           (_U_(0x1) << ACIFC_ISR_SUTINT1_Pos)
#define ACIFC_ISR_ACINT2_Pos        4            /**< \brief (ACIFC_ISR) AC2 Interrupt Status */
#define ACIFC_ISR_ACINT2            (_U_(0x1) << ACIFC_ISR_ACINT2_Pos)
#define ACIFC_ISR_SUTINT2_Pos       5            /**< \brief (ACIFC_ISR) AC2 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT2           (_U_(0x1) << ACIFC_ISR_SUTINT2_Pos)
#define ACIFC_ISR_ACINT3_Pos        6            /**< \brief (ACIFC_ISR) AC3 Interrupt Status */
#define ACIFC_ISR_ACINT3            (_U_(0x1) << ACIFC_ISR_ACINT3_Pos)
#define ACIFC_ISR_SUTINT3_Pos       7            /**< \brief (ACIFC_ISR) AC3 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT3           (_U_(0x1) << ACIFC_ISR_SUTINT3_Pos)
#define ACIFC_ISR_ACINT4_Pos        8            /**< \brief (ACIFC_ISR) AC4 Interrupt Status */
#define ACIFC_ISR_ACINT4            (_U_(0x1) << ACIFC_ISR_ACINT4_Pos)
#define ACIFC_ISR_SUTINT4_Pos       9            /**< \brief (ACIFC_ISR) AC4 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT4           (_U_(0x1) << ACIFC_ISR_SUTINT4_Pos)
#define ACIFC_ISR_ACINT5_Pos        10           /**< \brief (ACIFC_ISR) AC5 Interrupt Status */
#define ACIFC_ISR_ACINT5            (_U_(0x1) << ACIFC_ISR_ACINT5_Pos)
#define ACIFC_ISR_SUTINT5_Pos       11           /**< \brief (ACIFC_ISR) AC5 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT5           (_U_(0x1) << ACIFC_ISR_SUTINT5_Pos)
#define ACIFC_ISR_ACINT6_Pos        12           /**< \brief (ACIFC_ISR) AC6 Interrupt Status */
#define ACIFC_ISR_ACINT6            (_U_(0x1) << ACIFC_ISR_ACINT6_Pos)
#define ACIFC_ISR_SUTINT6_Pos       13           /**< \brief (ACIFC_ISR) AC6 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT6           (_U_(0x1) << ACIFC_ISR_SUTINT6_Pos)
#define ACIFC_ISR_ACINT7_Pos        14           /**< \brief (ACIFC_ISR) AC7 Interrupt Status */
#define ACIFC_ISR_ACINT7            (_U_(0x1) << ACIFC_ISR_ACINT7_Pos)
#define ACIFC_ISR_SUTINT7_Pos       15           /**< \brief (ACIFC_ISR) AC7 Startup Time Interrupt Status */
#define ACIFC_ISR_SUTINT7           (_U_(0x1) << ACIFC_ISR_SUTINT7_Pos)
#define ACIFC_ISR_WFINT0_Pos        24           /**< \brief (ACIFC_ISR) Window0 Mode Interrupt Status */
#define ACIFC_ISR_WFINT0            (_U_(0x1) << ACIFC_ISR_WFINT0_Pos)
#define ACIFC_ISR_WFINT1_Pos        25           /**< \brief (ACIFC_ISR) Window1 Mode Interrupt Status */
#define ACIFC_ISR_WFINT1            (_U_(0x1) << ACIFC_ISR_WFINT1_Pos)
#define ACIFC_ISR_WFINT2_Pos        26           /**< \brief (ACIFC_ISR) Window2 Mode Interrupt Status */
#define ACIFC_ISR_WFINT2            (_U_(0x1) << ACIFC_ISR_WFINT2_Pos)
#define ACIFC_ISR_WFINT3_Pos        27           /**< \brief (ACIFC_ISR) Window3 Mode Interrupt Status */
#define ACIFC_ISR_WFINT3            (_U_(0x1) << ACIFC_ISR_WFINT3_Pos)
#define ACIFC_ISR_MASK              _U_(0x0F00FFFF) /**< \brief (ACIFC_ISR) MASK Register */

