zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/acifc.h
/* -------- ACIFC_ICR : (ACIFC Offset: 0x20) ( /W 32) Interrupt Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACINT0:1;         /*!< bit:      0  AC0 Interrupt Status Clear         */
    uint32_t SUTINT0:1;        /*!< bit:      1  AC0 Startup Time Interrupt Status Clear */
    uint32_t ACINT1:1;         /*!< bit:      2  AC1 Interrupt Status Clear         */
    uint32_t SUTINT1:1;        /*!< bit:      3  AC1 Startup Time Interrupt Status Clear */
    uint32_t ACINT2:1;         /*!< bit:      4  AC2 Interrupt Status Clear         */
    uint32_t SUTINT2:1;        /*!< bit:      5  AC2 Startup Time Interrupt Status Clear */
    uint32_t ACINT3:1;         /*!< bit:      6  AC3 Interrupt Status Clear         */
    uint32_t SUTINT3:1;        /*!< bit:      7  AC3 Startup Time Interrupt Status Clear */
    uint32_t ACINT4:1;         /*!< bit:      8  AC4 Interrupt Status Clear         */
    uint32_t SUTINT4:1;        /*!< bit:      9  AC4 Startup Time Interrupt Status Clear */
    uint32_t ACINT5:1;         /*!< bit:     10  AC5 Interrupt Status Clear         */
    uint32_t SUTINT5:1;        /*!< bit:     11  AC5 Startup Time Interrupt Status Clear */
    uint32_t ACINT6:1;         /*!< bit:     12  AC6 Interrupt Status Clear         */
    uint32_t SUTINT6:1;        /*!< bit:     13  AC6 Startup Time Interrupt Status Clear */
    uint32_t ACINT7:1;         /*!< bit:     14  AC7 Interrupt Status Clear         */
    uint32_t SUTINT7:1;        /*!< bit:     15  AC7 Startup Time Interrupt Status Clear */
    uint32_t :8;               /*!< bit: 16..23  Reserved                           */
    uint32_t WFINT0:1;         /*!< bit:     24  Window0 Mode Interrupt Status Clear */
    uint32_t WFINT1:1;         /*!< bit:     25  Window1 Mode Interrupt Status Clear */
    uint32_t WFINT2:1;         /*!< bit:     26  Window2 Mode Interrupt Status Clear */
    uint32_t WFINT3:1;         /*!< bit:     27  Window3 Mode Interrupt Status Clear */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_ICR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_ICR_OFFSET            0x20         /**< \brief (ACIFC_ICR offset) Interrupt Status Clear Register */
#define ACIFC_ICR_RESETVALUE        _U_(0x00000000); /**< \brief (ACIFC_ICR reset_value) Interrupt Status Clear Register */

#define ACIFC_ICR_ACINT0_Pos        0            /**< \brief (ACIFC_ICR) AC0 Interrupt Status Clear */
#define ACIFC_ICR_ACINT0            (_U_(0x1) << ACIFC_ICR_ACINT0_Pos)
#define ACIFC_ICR_SUTINT0_Pos       1            /**< \brief (ACIFC_ICR) AC0 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT0           (_U_(0x1) << ACIFC_ICR_SUTINT0_Pos)
#define ACIFC_ICR_ACINT1_Pos        2            /**< \brief (ACIFC_ICR) AC1 Interrupt Status Clear */
#define ACIFC_ICR_ACINT1            (_U_(0x1) << ACIFC_ICR_ACINT1_Pos)
#define ACIFC_ICR_SUTINT1_Pos       3            /**< \brief (ACIFC_ICR) AC1 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT1           (_U_(0x1) << ACIFC_ICR_SUTINT1_Pos)
#define ACIFC_ICR_ACINT2_Pos        4            /**< \brief (ACIFC_ICR) AC2 Interrupt Status Clear */
#define ACIFC_ICR_ACINT2            (_U_(0x1) << ACIFC_ICR_ACINT2_Pos)
#define ACIFC_ICR_SUTINT2_Pos       5            /**< \brief (ACIFC_ICR) AC2 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT2           (_U_(0x1) << ACIFC_ICR_SUTINT2_Pos)
#define ACIFC_ICR_ACINT3_Pos        6            /**< \brief (ACIFC_ICR) AC3 Interrupt Status Clear */
#define ACIFC_ICR_ACINT3            (_U_(0x1) << ACIFC_ICR_ACINT3_Pos)
#define ACIFC_ICR_SUTINT3_Pos       7            /**< \brief (ACIFC_ICR) AC3 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT3           (_U_(0x1) << ACIFC_ICR_SUTINT3_Pos)
#define ACIFC_ICR_ACINT4_Pos        8            /**< \brief (ACIFC_ICR) AC4 Interrupt Status Clear */
#define ACIFC_ICR_ACINT4            (_U_(0x1) << ACIFC_ICR_ACINT4_Pos)
#define ACIFC_ICR_SUTINT4_Pos       9            /**< \brief (ACIFC_ICR) AC4 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT4           (_U_(0x1) << ACIFC_ICR_SUTINT4_Pos)
#define ACIFC_ICR_ACINT5_Pos        10           /**< \brief (ACIFC_ICR) AC5 Interrupt Status Clear */
#define ACIFC_ICR_ACINT5            (_U_(0x1) << ACIFC_ICR_ACINT5_Pos)
#define ACIFC_ICR_SUTINT5_Pos       11           /**< \brief (ACIFC_ICR) AC5 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT5           (_U_(0x1) << ACIFC_ICR_SUTINT5_Pos)
#define ACIFC_ICR_ACINT6_Pos        12           /**< \brief (ACIFC_ICR) AC6 Interrupt Status Clear */
#define ACIFC_ICR_ACINT6            (_U_(0x1) << ACIFC_ICR_ACINT6_Pos)
#define ACIFC_ICR_SUTINT6_Pos       13           /**< \brief (ACIFC_ICR) AC6 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT6           (_U_(0x1) << ACIFC_ICR_SUTINT6_Pos)
#define ACIFC_ICR_ACINT7_Pos        14           /**< \brief (ACIFC_ICR) AC7 Interrupt Status Clear */
#define ACIFC_ICR_ACINT7            (_U_(0x1) << ACIFC_ICR_ACINT7_Pos)
#define ACIFC_ICR_SUTINT7_Pos       15           /**< \brief (ACIFC_ICR) AC7 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_SUTINT7           (_U_(0x1) << ACIFC_ICR_SUTINT7_Pos)
#define ACIFC_ICR_WFINT0_Pos        24           /**< \brief (ACIFC_ICR) Window0 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT0            (_U_(0x1) << ACIFC_ICR_WFINT0_Pos)
#define ACIFC_ICR_WFINT1_Pos        25           /**< \brief (ACIFC_ICR) Window1 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT1            (_U_(0x1) << ACIFC_ICR_WFINT1_Pos)
#define ACIFC_ICR_WFINT2_Pos        26           /**< \brief (ACIFC_ICR) Window2 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT2            (_U_(0x1) << ACIFC_ICR_WFINT2_Pos)
#define ACIFC_ICR_WFINT3_Pos        27           /**< \brief (ACIFC_ICR) Window3 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT3            (_U_(0x1) << ACIFC_ICR_WFINT3_Pos)
#define ACIFC_ICR_MASK              _U_(0x0F00FFFF) /**< \brief (ACIFC_ICR) MASK Register */

/* -------- ACIFC_TR : (ACIFC Offset: 0x24) (R/W 32) Test Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACTEST0:1;        /*!< bit:      0  AC0 Output Override Value          */
    uint32_t ACTEST1:1;        /*!< bit:      1  AC1 Output Override Value          */
    uint32_t ACTEST2:1;        /*!< bit:      2  AC2 Output Override Value          */
    uint32_t ACTEST3:1;        /*!< bit:      3  AC3 Output Override Value          */
    uint32_t ACTEST4:1;        /*!< bit:      4  AC4 Output Override Value          */
    uint32_t ACTEST5:1;        /*!< bit:      5  AC5 Output Override Value          */
    uint32_t ACTEST6:1;        /*!< bit:      6  AC6 Output Override Value          */
    uint32_t ACTEST7:1;        /*!< bit:      7  AC7 Output Override Value          */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_TR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_TR_OFFSET             0x24         /**< \brief (ACIFC_TR offset) Test Register */
#define ACIFC_TR_RESETVALUE         _U_(0x00000000); /**< \brief (ACIFC_TR reset_value) Test Register */

#define ACIFC_TR_ACTEST0_Pos        0            /**< \brief (ACIFC_TR) AC0 Output Override Value */
#define ACIFC_TR_ACTEST0            (_U_(0x1) << ACIFC_TR_ACTEST0_Pos)
#define ACIFC_TR_ACTEST1_Pos        1            /**< \brief (ACIFC_TR) AC1 Output Override Value */
#define ACIFC_TR_ACTEST1            (_U_(0x1) << ACIFC_TR_ACTEST1_Pos)
#define ACIFC_TR_ACTEST2_Pos        2            /**< \brief (ACIFC_TR) AC2 Output Override Value */
#define ACIFC_TR_ACTEST2            (_U_(0x1) << ACIFC_TR_ACTEST2_Pos)
#define ACIFC_TR_ACTEST3_Pos        3            /**< \brief (ACIFC_TR) AC3 Output Override Value */
#define ACIFC_TR_ACTEST3            (_U_(0x1) << ACIFC_TR_ACTEST3_Pos)
#define ACIFC_TR_ACTEST4_Pos        4            /**< \brief (ACIFC_TR) AC4 Output Override Value */
#define ACIFC_TR_ACTEST4            (_U_(0x1) << ACIFC_TR_ACTEST4_Pos)
#define ACIFC_TR_ACTEST5_Pos        5            /**< \brief (ACIFC_TR) AC5 Output Override Value */
#define ACIFC_TR_ACTEST5            (_U_(0x1) << ACIFC_TR_ACTEST5_Pos)
#define ACIFC_TR_ACTEST6_Pos        6            /**< \brief (ACIFC_TR) AC6 Output Override Value */
#define ACIFC_TR_ACTEST6            (_U_(0x1) << ACIFC_TR_ACTEST6_Pos)
#define ACIFC_TR_ACTEST7_Pos        7            /**< \brief (ACIFC_TR) AC7 Output Override Value */
#define ACIFC_TR_ACTEST7            (_U_(0x1) << ACIFC_TR_ACTEST7_Pos)
#define ACIFC_TR_MASK               _U_(0x000000FF) /**< \brief (ACIFC_TR) MASK Register */

/* -------- ACIFC_PARAMETER : (ACIFC Offset: 0x30) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ACIMPL0:1;        /*!< bit:      0  Analog Comparator 0 Implemented    */
    uint32_t ACIMPL1:1;        /*!< bit:      1  Analog Comparator 1 Implemented    */
    uint32_t ACIMPL2:1;        /*!< bit:      2  Analog Comparator 2 Implemented    */
    uint32_t ACIMPL3:1;        /*!< bit:      3  Analog Comparator 3 Implemented    */
    uint32_t ACIMPL4:1;        /*!< bit:      4  Analog Comparator 4 Implemented    */
    uint32_t ACIMPL5:1;        /*!< bit:      5  Analog Comparator 5 Implemented    */
    uint32_t ACIMPL6:1;        /*!< bit:      6  Analog Comparator 6 Implemented    */
    uint32_t ACIMPL7:1;        /*!< bit:      7  Analog Comparator 7 Implemented    */
    uint32_t :8;               /*!< bit:  8..15  Reserved                           */
    uint32_t WIMPL0:1;         /*!< bit:     16  Window0 Mode  Implemented          */
    uint32_t WIMPL1:1;         /*!< bit:     17  Window1 Mode  Implemented          */
    uint32_t WIMPL2:1;         /*!< bit:     18  Window2 Mode  Implemented          */
    uint32_t WIMPL3:1;         /*!< bit:     19  Window3 Mode  Implemented          */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_PARAMETER_OFFSET      0x30         /**< \brief (ACIFC_PARAMETER offset) Parameter Register */

#define ACIFC_PARAMETER_ACIMPL0_Pos 0            /**< \brief (ACIFC_PARAMETER) Analog Comparator 0 Implemented */
#define ACIFC_PARAMETER_ACIMPL0     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL0_Pos)
#define ACIFC_PARAMETER_ACIMPL1_Pos 1            /**< \brief (ACIFC_PARAMETER) Analog Comparator 1 Implemented */
#define ACIFC_PARAMETER_ACIMPL1     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL1_Pos)
#define ACIFC_PARAMETER_ACIMPL2_Pos 2            /**< \brief (ACIFC_PARAMETER) Analog Comparator 2 Implemented */
#define ACIFC_PARAMETER_ACIMPL2     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL2_Pos)
#define ACIFC_PARAMETER_ACIMPL3_Pos 3            /**< \brief (ACIFC_PARAMETER) Analog Comparator 3 Implemented */
#define ACIFC_PARAMETER_ACIMPL3     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL3_Pos)
#define ACIFC_PARAMETER_ACIMPL4_Pos 4            /**< \brief (ACIFC_PARAMETER) Analog Comparator 4 Implemented */
#define ACIFC_PARAMETER_ACIMPL4     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL4_Pos)
#define ACIFC_PARAMETER_ACIMPL5_Pos 5            /**< \brief (ACIFC_PARAMETER) Analog Comparator 5 Implemented */
#define ACIFC_PARAMETER_ACIMPL5     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL5_Pos)
#define ACIFC_PARAMETER_ACIMPL6_Pos 6            /**< \brief (ACIFC_PARAMETER) Analog Comparator 6 Implemented */
#define ACIFC_PARAMETER_ACIMPL6     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL6_Pos)
#define ACIFC_PARAMETER_ACIMPL7_Pos 7            /**< \brief (ACIFC_PARAMETER) Analog Comparator 7 Implemented */
#define ACIFC_PARAMETER_ACIMPL7     (_U_(0x1) << ACIFC_PARAMETER_ACIMPL7_Pos)
#define ACIFC_PARAMETER_WIMPL0_Pos  16           /**< \brief (ACIFC_PARAMETER) Window0 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL0      (_U_(0x1) << ACIFC_PARAMETER_WIMPL0_Pos)
#define ACIFC_PARAMETER_WIMPL1_Pos  17           /**< \brief (ACIFC_PARAMETER) Window1 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL1      (_U_(0x1) << ACIFC_PARAMETER_WIMPL1_Pos)
#define ACIFC_PARAMETER_WIMPL2_Pos  18           /**< \brief (ACIFC_PARAMETER) Window2 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL2      (_U_(0x1) << ACIFC_PARAMETER_WIMPL2_Pos)
#define ACIFC_PARAMETER_WIMPL3_Pos  19           /**< \brief (ACIFC_PARAMETER) Window3 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL3      (_U_(0x1) << ACIFC_PARAMETER_WIMPL3_Pos)
#define ACIFC_PARAMETER_MASK        _U_(0x000F00FF) /**< \brief (ACIFC_PARAMETER) MASK Register */

/* -------- ACIFC_VERSION : (ACIFC Offset: 0x34) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant Number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_VERSION_OFFSET        0x34         /**< \brief (ACIFC_VERSION offset) Version Register */
#define ACIFC_VERSION_RESETVALUE    _U_(0x00000101); /**< \brief (ACIFC_VERSION reset_value) Version Register */

#define ACIFC_VERSION_VERSION_Pos   0            /**< \brief (ACIFC_VERSION) Version Number */
#define ACIFC_VERSION_VERSION_Msk   (_U_(0xFFF) << ACIFC_VERSION_VERSION_Pos)
#define ACIFC_VERSION_VERSION(value) (ACIFC_VERSION_VERSION_Msk & ((value) << ACIFC_VERSION_VERSION_Pos))
#define ACIFC_VERSION_VARIANT_Pos   16           /**< \brief (ACIFC_VERSION) Variant Number */
#define ACIFC_VERSION_VARIANT_Msk   (_U_(0xF) << ACIFC_VERSION_VARIANT_Pos)
#define ACIFC_VERSION_VARIANT(value) (ACIFC_VERSION_VARIANT_Msk & ((value) << ACIFC_VERSION_VARIANT_Pos))
#define ACIFC_VERSION_MASK          _U_(0x000F0FFF) /**< \brief (ACIFC_VERSION) MASK Register */

/* -------- ACIFC_CONFW : (ACIFC Offset: 0x80) (R/W 32) CONFW Window configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t WIS:3;            /*!< bit:  0.. 2  Window Mode Interrupt Settings     */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t WEVSRC:3;         /*!< bit:  8..10  Peripheral Event Sourse Selection for Window Mode */
    uint32_t WEVEN:1;          /*!< bit:     11  Window Peripheral Event Enable     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t WFEN:1;           /*!< bit:     16  Window Mode Enable                 */
    uint32_t :15;              /*!< bit: 17..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} ACIFC_CONFW_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ACIFC_CONFW_OFFSET          0x80         /**< \brief (ACIFC_CONFW offset) Window configuration Register */
#define ACIFC_CONFW_RESETVALUE      _U_(0x00000000); /**< \brief (ACIFC_CONFW reset_value) Window configuration Register */

#define ACIFC_CONFW_WIS_Pos         0            /**< \brief (ACIFC_CONFW) Window Mode Interrupt Settings */
#define ACIFC_CONFW_WIS_Msk         (_U_(0x7) << ACIFC_CONFW_WIS_Pos)
#define ACIFC_CONFW_WIS(value)      (ACIFC_CONFW_WIS_Msk & ((value) << ACIFC_CONFW_WIS_Pos))
#define ACIFC_CONFW_WEVSRC_Pos      8            /**< \brief (ACIFC_CONFW) Peripheral Event Sourse Selection for Window Mode */
#define ACIFC_CONFW_WEVSRC_Msk      (_U_(0x7) << ACIFC_CONFW_WEVSRC_Pos)
#define ACIFC_CONFW_WEVSRC(value)   (ACIFC_CONFW_WEVSRC_Msk & ((value) << ACIFC_CONFW_WEVSRC_Pos))
#define ACIFC_CONFW_WEVEN_Pos       11           /**< \brief (ACIFC_CONFW) Window Peripheral Event Enable */
#define ACIFC_CONFW_WEVEN           (_U_(0x1) << ACIFC_CONFW_WEVEN_Pos)
#define ACIFC_CONFW_WFEN_Pos        16           /**< \brief (ACIFC_CONFW) Window Mode Enable */
#define ACIFC_CONFW_WFEN            (_U_(0x1) << ACIFC_CONFW_WFEN_Pos)
#define ACIFC_CONFW_MASK            _U_(0x00010F07) /**< \brief (ACIFC_CONFW) MASK Register */

